Revit 2026 API

# DuctFittingAndAccessoryPressureDropUIDataItem Properties

---

The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DuctFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Mechanical Namespace